run/icoPhaseChangeVoF/solidification2D/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [temperature];

internalField   uniform 540.55;

/*
internalField
{
    type        coded;

    evaluate
    #{
        const scalar lx = 0.015;
        const scalar dT = 12.0;
        const scalar T0 = 546.55;

        const scalarField x(C.component(vector::X));

        field.primitiveFieldRef() = T0 + (0.5*lx - x)/lx*dT;
    #};
}
*/

boundaryField
{
    "(top|bottom)"
    {
        type            zeroGradient;
    }

    right
    {
        type            fixedValue;
        value           uniform 540.55;
    }

    left
    {
        type            fixedValue;
        value           uniform 552.55;
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //