run/icoPhaseChangeVoF/solidification2D/0/alpha.bismuth
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.bismuth;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField
{
    type        zonal;

    defaultValue    0;

    zones
    {
        metalPlate
        {
            type            box;

            box             (-1 -1 -1) (1 0.004 1);

            value           1;
        }
    }
}

boundaryField
{
    "(top|right|left|bottom)"
    {
        type            zeroGradient;
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //