run/icoPhaseChangeVoF/solidification2D/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [pressure];

internalField   uniform 0;

boundaryField
{
    "(top|right|left|bottom)"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //