run/icoPhaseChangeVoF/solidification2D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# pre-processing
runApplication blockMesh
runApplication checkMesh

# run in parallel
if [ "$1" = "parallel" ]
then
    # run in parallel mode
    runApplication decomposePar -cellProc
    runParallel foamRun
    runApplication reconstructPar
else
    # run in serial mode
    runApplication foamRun
fi

#------------------------------------------------------------------------------