run/icoPhaseChangeVoF/solidification2D/constant/physicalProperties.bismuth
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   208.0;
    }

    equationOfState
    {
        rho         9780.0;
    }

    thermodynamics
    {
        Cp          123;
        hf          0;
    }

    transport
    {
        mu          0.0016;
        kappa       10.35;
    }
}

solidification
{
    type    linearImplicit;
    L       44600;
    Tsol    544;
    Tliq    545;
    relax   0.9;
}


// ************************************************************************* //
